-- phpMyAdmin SQL Dump
-- version 4.5.1
-- http://www.phpmyadmin.net
--
-- Хост: 127.0.0.1
-- Время создания: Июн 28 2016 г., 15:21
-- Версия сервера: 10.1.10-MariaDB
-- Версия PHP: 5.6.19

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `routecalculation`
--

-- --------------------------------------------------------

--
-- Структура таблицы `distancesmatrix`
--

CREATE TABLE `distancesmatrix` (
  `idistancesmatrix` int(11) NOT NULL,
  `distance` int(11) NOT NULL,
  `start` varchar(255) NOT NULL,
  `finish` varchar(255) NOT NULL,
  `id_center` int(11) NOT NULL,
  `id_centerspost_start` int(11) NOT NULL,
  `id_centerspost_finish` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `distancesmatrix`
--

INSERT INTO `distancesmatrix` (`idistancesmatrix`, `distance`, `start`, `finish`, `id_center`, `id_centerspost_start`, `id_centerspost_finish`) VALUES
(1, 74, 'Луганск ЦОПП', 'Калиново', 2, 1, 2),
(2, 78, 'Луганск ЦОПП', 'Первомайск-5', 2, 1, 3),
(3, 78, 'Луганск ЦОПП', 'Первомайск', 2, 1, 4),
(4, 88, 'Луганск ЦОПП', 'Золотое-5', 2, 1, 5),
(5, 85, 'Луганск ЦОПП', 'Березовское', 2, 1, 6),
(6, 85, 'Луганск ЦОПП', 'Голубовское', 2, 1, 7),
(7, 88, 'Луганск ЦОПП', 'Донецкий', 2, 1, 8),
(8, 78, 'Луганск ЦОПП', 'Кировск-1', 2, 1, 9),
(9, 76, 'Луганск ЦОПП', 'Кировск-6', 2, 1, 10),
(11, 77, 'Луганск ЦОПП', 'Кировск-7', 2, 1, 11),
(12, 75, 'Луганск ЦОПП', 'Кировск-3', 2, 1, 12),
(13, 89, 'Луганск ЦОПП', 'Червоногвардейское', 2, 1, 13),
(14, 74, 'Калиново', 'Луганск ЦОПП', 2, 2, 1),
(15, 15, 'Калиново', 'Первомайск-5', 2, 2, 3),
(16, 15, 'Калиново', 'Первомайск', 2, 2, 4),
(17, 22, 'Калиново', 'Золотое-5', 2, 2, 5),
(18, 21, 'Калиново', 'Березовское', 2, 2, 6),
(19, 21, 'Калиново', 'Голубовское', 2, 2, 7),
(20, 32, 'Калиново', 'Донецкий', 2, 2, 8),
(21, 24, 'Калиново', 'Кировск-1', 2, 2, 9),
(22, 22, 'Калиново', 'Кировск-6', 2, 2, 10),
(23, 23, 'Калиново', 'Кировск-7', 2, 2, 11),
(24, 21, 'Калиново', 'Кировск-3', 2, 2, 12),
(25, 27, 'Калиново', 'Червоногвардейское', 2, 2, 13),
(26, 78, 'Первомайск-5', 'Луганск ЦОПП', 2, 3, 1),
(27, 15, 'Первомайск-5', 'Калиново', 2, 3, 2),
(28, 9, 'Первомайск-5', 'Первомайск', 2, 3, 4),
(29, 12, 'Первомайск-5', 'Золотое-5', 2, 3, 5),
(30, 12, 'Первомайск-5', 'Березовское', 2, 3, 6),
(31, 15, 'Первомайск-5', 'Голубовское', 2, 3, 7),
(32, 20, 'Первомайск-5', 'Донецкий', 2, 3, 8),
(33, 14, 'Первомайск-5', 'Кировск-1', 2, 3, 9),
(34, 13, 'Первомайск-5', 'Кировск-6', 2, 3, 10),
(35, 14, 'Первомайск-5', 'Кировск-7', 2, 3, 11),
(36, 12, 'Первомайск-5', 'Кировск-3', 2, 3, 12),
(37, 20, 'Первомайск-5', 'Червоногвардейское', 2, 3, 13),
(38, 88, 'Золотое-5', 'Луганск ЦОПП', 2, 5, 1),
(39, 22, 'Золотое-5', 'Калиново', 2, 5, 2),
(40, 12, 'Золотое-5', 'Первомайск-5', 2, 5, 3),
(41, 14, 'Золотое-5', 'Первомайск', 2, 5, 4),
(42, 14, 'Золотое-5', 'Березовское', 2, 5, 6),
(43, 14, 'Золотое-5', 'Голубовское', 2, 5, 7),
(44, 26, 'Золотое-5', 'Донецкий', 2, 5, 8),
(45, 19, 'Золотое-5', 'Кировск-1', 2, 5, 9),
(46, 22, 'Золотое-5', 'Кировск-6', 2, 5, 10),
(47, 22, 'Золотое-5', 'Кировск-7', 2, 5, 11),
(48, 22, 'Золотое-5', 'Кировск-3', 2, 5, 12),
(49, 29, 'Золотое-5', 'Червоногвардейское', 2, 5, 13),
(50, 78, 'Первомайск', 'Луганск ЦОПП', 2, 4, 1),
(51, 15, 'Первомайск', 'Калиново', 2, 4, 2),
(52, 9, 'Первомайск', 'Первомайск-5', 2, 4, 3),
(53, 14, 'Первомайск', 'Золотое-5', 2, 4, 5),
(54, 11, 'Первомайск', 'Березовское', 2, 4, 6),
(55, 20, 'Первомайск', 'Голубовское', 2, 4, 7),
(56, 22, 'Первомайск', 'Донецкий', 2, 4, 8),
(57, 16, 'Первомайск', 'Кировск-1', 2, 4, 9),
(58, 15, 'Первомайск', 'Кировск-6', 2, 4, 10),
(59, 16, 'Первомайск', 'Кировск-7 ', 2, 4, 11),
(60, 14, 'Первомайск', 'Кировск-3', 2, 4, 12),
(61, 22, 'Первомайск', 'Червоногвардейское', 2, 4, 13),
(62, 85, 'Березовское', 'Луганск ЦОПП', 2, 6, 1),
(63, 21, 'Березовское', 'Калиново', 2, 6, 2),
(64, 12, 'Березовское', 'Первомайск-5', 2, 6, 3),
(65, 11, 'Березовское', 'Первомайск', 2, 6, 4),
(66, 14, 'Березовское', 'Золотое-5', 2, 6, 5),
(67, 6, 'Березовское', 'Голубовское', 2, 6, 7),
(68, 10, 'Березовское', 'Донецкий', 2, 6, 8),
(69, 10, 'Березовское', 'Кировск-1', 2, 6, 9),
(70, 12, 'Березовское', 'Кировск-6', 2, 6, 10),
(71, 13, 'Березовское', 'Кировск-7 ', 2, 6, 11),
(72, 11, 'Березовское', 'Кировск-3', 2, 6, 12),
(73, 20, 'Березовское', 'Червоногвардейское', 2, 6, 13),
(74, 85, 'Голубовское', 'Луганск ЦОПП', 2, 7, 1),
(75, 24, 'Голубовское', 'Калиново', 2, 7, 2),
(76, 15, 'Голубовское', 'Первомайск-5', 2, 7, 3),
(77, 20, 'Голубовское', 'Первомайск', 2, 7, 4),
(78, 14, 'Голубовское', 'Золотое-5', 2, 7, 5),
(79, 6, 'Голубовское', 'Березовское', 2, 7, 6),
(80, 6, 'Голубовское', 'Донецкий', 2, 7, 8),
(81, 7, 'Голубовское', 'Кировск-1', 2, 7, 9),
(82, 12, 'Голубовское', 'Кировск-6', 2, 7, 10),
(83, 11, 'Голубовское', 'Кировск-7 ', 2, 7, 11),
(84, 12, 'Голубовское', 'Кировск-3', 2, 7, 12),
(85, 20, 'Голубовское', 'Червоногвардейское', 2, 7, 13),
(86, 88, 'Донецкий', 'Луганск ЦОПП', 2, 8, 1),
(87, 32, 'Донецкий', 'Калиново', 2, 8, 2),
(88, 20, 'Донецкий', 'Первомайск-5', 2, 8, 3),
(89, 22, 'Донецкий', 'Первомайск', 2, 8, 4),
(90, 16, 'Донецкий', 'Золотое-5', 2, 8, 5),
(91, 10, 'Донецкий', 'Березовское', 2, 8, 6),
(92, 6, 'Донецкий', 'Голубовское', 2, 8, 7),
(93, 9, 'Донецкий', 'Кировск-1', 2, 8, 9),
(94, 11, 'Донецкий', 'Кировск-6', 2, 8, 10),
(95, 13, 'Донецкий', 'Кировск-7 ', 2, 8, 11),
(96, 12, 'Донецкий', 'Кировск-3', 2, 8, 12),
(97, 20, 'Донецкий', 'Червоногвардейское', 2, 8, 13),
(98, 78, 'Кировск-1', 'Луганск ЦОПП', 2, 9, 1),
(99, 21, 'Кировск-1', 'Калиново', 2, 9, 2),
(100, 14, 'Кировск-1', 'Первомайск-5', 2, 9, 3),
(101, 16, 'Кировск-1', 'Первомайск', 2, 9, 4),
(102, 19, 'Кировск-1', 'Золотое-5', 2, 9, 5),
(103, 7, 'Кировск-1', 'Березовское', 2, 9, 6),
(104, 9, 'Кировск-1', 'Голубовское', 2, 9, 7),
(105, 5, 'Кировск-1', 'Донецкий', 2, 9, 8),
(106, 5, 'Кировск-1', 'Кировск-6', 2, 9, 10),
(107, 4, 'Кировск-1', 'Кировск-7 ', 2, 9, 11),
(108, 5, 'Кировск-1', 'Кировск-3', 2, 9, 12),
(109, 12, 'Кировск-1', 'Червоногвардейское', 2, 9, 13),
(110, 76, 'Кировск-6', 'Луганск ЦОПП', 2, 10, 1),
(111, 22, 'Кировск-6', 'Калиново', 2, 10, 2),
(112, 13, 'Кировск-6', 'Первомайск-5', 2, 10, 3),
(113, 15, 'Кировск-6', 'Первомайск', 2, 10, 4),
(114, 22, 'Кировск-6', 'Золотое-5', 2, 10, 5),
(115, 12, 'Кировск-6', 'Березовское', 2, 10, 6),
(116, 12, 'Кировск-6', 'Голубовское', 2, 10, 7),
(117, 11, 'Кировск-6', 'Донецкий', 2, 10, 8),
(118, 15, 'Кировск-6', 'Кировск-1', 2, 10, 9),
(119, 4, 'Кировск-6', 'Кировск-7 ', 2, 10, 11),
(120, 2, 'Кировск-6', 'Кировск-3', 2, 10, 12),
(121, 10, 'Кировск-6', 'Червоногвардейское', 2, 10, 13),
(122, 77, 'Кировск-7', 'Луганск ЦОПП', 2, 11, 1),
(123, 23, 'Кировск-7', 'Калиново', 2, 11, 2),
(124, 14, 'Кировск-7', 'Первомайск-5', 2, 11, 3),
(125, 16, 'Кировск-7', 'Первомайск', 2, 11, 4),
(126, 22, 'Кировск-7', 'Золотое-5', 2, 11, 5),
(127, 13, 'Кировск-7', 'Березовское', 2, 11, 6),
(128, 11, 'Кировск-7', 'Голубовское', 2, 11, 7),
(129, 13, 'Кировск-7', 'Донецкий', 2, 11, 8),
(130, 4, 'Кировск-7', 'Кировск-1', 2, 11, 9),
(131, 4, 'Кировск-7', 'Кировск-6 ', 2, 11, 10),
(132, 3, 'Кировск-7', 'Кировск-3', 2, 11, 12),
(133, 11, 'Кировск-7', 'Червоногвардейское', 2, 11, 13),
(134, 75, 'Кировск-3', 'Луганск ЦОПП', 2, 12, 1),
(135, 21, 'Кировск-3', 'Калиново', 2, 12, 2),
(136, 12, 'Кировск-3', 'Первомайск-5', 2, 12, 3),
(137, 14, 'Кировск-3', 'Первомайск', 2, 12, 4),
(138, 22, 'Кировск-3', 'Золотое-5', 2, 12, 5),
(139, 11, 'Кировск-3', 'Березовское', 2, 12, 6),
(140, 12, 'Кировск-3', 'Голубовское', 2, 12, 7),
(141, 12, 'Кировск-3', 'Донецкий', 2, 12, 8),
(142, 5, 'Кировск-3', 'Кировск-1', 2, 12, 9),
(143, 2, 'Кировск-3', 'Кировск-6 ', 2, 12, 10),
(144, 3, 'Кировск-3', 'Кировск-7', 2, 12, 11),
(145, 9, 'Кировск-3', 'Червоногвардейское', 2, 12, 13),
(146, 89, 'Червоногвардейское', 'Луганск ЦОПП', 2, 13, 1),
(147, 27, 'Червоногвардейское', 'Калиново', 2, 13, 2),
(148, 20, 'Червоногвардейское', 'Первомайск-5', 2, 13, 3),
(149, 22, 'Червоногвардейское', 'Первомайск', 2, 13, 4),
(150, 29, 'Червоногвардейское', 'Золотое-5', 2, 13, 5),
(151, 20, 'Червоногвардейское', 'Березовское', 2, 13, 6),
(152, 20, 'Червоногвардейское', 'Голубовское', 2, 13, 7),
(153, 20, 'Червоногвардейское', 'Донецкий', 2, 13, 8),
(154, 12, 'Червоногвардейское', 'Кировск-1', 2, 13, 9),
(155, 10, 'Червоногвардейское', 'Кировск-6 ', 2, 13, 10),
(156, 11, 'Червоногвардейское', 'Кировск-7', 2, 13, 11),
(157, 9, 'Червоногвардейское', 'Кировск-3', 2, 13, 12),
(158, 78, 'Первомайск-ЦПС 1', 'Луганск ЦОПП', 2, 14, 1),
(159, 15, 'Первомайск-ЦПС 1', 'Калиново', 2, 14, 2),
(160, 9, 'Первомайск-ЦПС 1', 'Первомайск-5', 14, 4, 3),
(161, 14, 'Первомайск-ЦПС 1', 'Золотое-5', 2, 14, 5),
(162, 11, 'Первомайск-ЦПС 1', 'Березовское', 2, 14, 6),
(163, 20, 'Первомайск-ЦПС 1', 'Голубовское', 2, 14, 7),
(164, 22, 'Первомайск-ЦПС 1', 'Донецкий', 2, 14, 8),
(165, 16, 'Первомайск-ЦПС 1', 'Кировск-1', 2, 14, 9),
(166, 15, 'Первомайск-ЦПС 1', 'Кировск-6', 2, 14, 10),
(167, 16, 'Первомайск-ЦПС 1', 'Кировск-7 ', 2, 14, 11),
(168, 14, 'Первомайск-ЦПС 1', 'Кировск-3', 2, 14, 12),
(169, 22, 'Первомайск-ЦПС 1', 'Червоногвардейское', 2, 14, 13),
(170, 2, 'Главная касса', 'Банк', 2, 16, 17),
(171, 2, 'Банк', 'Главная касса', 2, 17, 16),
(172, 2, 'Луганск Центральная касса', 'Банк', 2, 1, 17),
(173, 2, 'Банк', 'Луганск Центральная касса', 2, 17, 1),
(174, 0, 'Луганск Центральная касса', 'Главная касса', 2, 1, 16),
(175, 0, 'Главная касса', 'Луганск Центральная касса', 2, 16, 1);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `distancesmatrix`
--
ALTER TABLE `distancesmatrix`
  ADD PRIMARY KEY (`idistancesmatrix`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `distancesmatrix`
--
ALTER TABLE `distancesmatrix`
  MODIFY `idistancesmatrix` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=176;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
